Revit 2026 API

# LightDimmingColor Enumeration

---

Tags for specific light dimming colors

**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum LightDimmingColor
```
```vb
Public Enumeration LightDimmingColor
```
```cpp
public enum class LightDimmingColor
```
```fsharp
type LightDimmingColor
```

| Member name | Value | Description |
| --- | --- | --- |
| Incandescent | 1 | Incandescent lamp curve dimming color. |
| None | 0 | No dimming color. |

#### Reference

Autodesk.Revit.DB.Lighting Namespace